Repository: Metamaquina/Printrun
Catalog: locale/*/LC_MESSAGES/plater.po
Languages: pt

source: Clear
pt: Apagar

source: Load
pt: Carregar

source: Export
pt: Exportar

source: Done
pt: Terminar

source: Cancel
pt: Cancelar

source: Put at 100, 100
pt: Pôr em 100, 100

source: Delete
pt: Deletar

source: Bed full, sorry sir :(
pt: Cama cheia, desculpe :(

source: Are you sure you want to clear the grid? All unsaved changes will be lost.
pt: Tem certeza que deseja apagar a malha? Todas as mudanças que não foram salvas serão perdidas.

source: Clear the grid?
pt: Apagar a malha?

source: Pick file to save to
pt: Escolha o arquivo onde deve ser salvo

source: STL files (;*.stl;*.STL;)
pt: Arquivos STL (;*.stl;*.STL;)

source: wrote %s
pt: salvou %s

source: Pick file to load
pt: Escolha arquivo para carregar

source: STL files (;*.stl;*.STL;)|*.stl|OpenSCAD files (;*.scad;)|*.scad
pt: Arquivos STL (;*.stl;*.STL;)|*.stl|Arquivos OpenSCAD (;*.scad;)|*.scad
