Repository: Metamaquina/Printrun
Catalog: locale/*/LC_MESSAGES/pronterface.po
Languages: pt

source: Find
pt: Procurar

source: Save
pt: Salvar

source: Cancel
pt: Cancelar

source: Edit settings
pt: Editar configurações

source: Defaults
pt: Padrões

source: Custom button
pt: Botão personalizado

source: Button title
pt: Título do botão

source: Command
pt: Comando

source: Color
pt: Cor

source: Adjusting bed level
pt: Ajuste de nível da plataforma de impressão

source: In this step we'll calibrate the height of the heated bed. If the printer is moving, please wait until it stops. Then use the 'up' and 'down' buttons below in order to make the extruder nozzle gently touch the heated bed surface. Once you're finished, press 'next'.
pt: Nesse passo iremos calibrar a altura da plataforma de impressão. Se a impressora estiver se movendo, por favor aguarde até ela parar. Depois use os botões abaixo para fazer a ponta do bico extrusor tocar levemente a superfície da plataforma de impressão. Quando você terminar, pressione o botão 'próximo'.

source: Printer:
pt: Impressora:

source: Quality:
pt: Qualidade:

source: Filament:
pt: Filamento:

source: Fill density:
pt: Densidade do preenchimento:

source: Support:
pt: Material de suporte:

source: Use support material
pt: habilitar

source: Success!
pt: Successo!

source: The printer has now saved the calibration to it's internal memory. The printer will always restore this calibration setting from memory when it's turned on, so you don't need to repeat this process, unless the heated bed leveling is changed.
pt: Agora a impressora salvou a calibração em sua memória interna e irá recuperar essa calibração da memória toda vez que for ligada, de modo que você não precisará repetir este processo a não ser que haja alguma mudança na altura da plataforma de impressão.

source: Are you sure?
pt: Você tem certeza?

source: This will interrupt any printjob in execution! Are you sure you want to close the program?
pt: Isso irá interromper qualquer impressão que estiver em andamento! Você tem certeza de que quer fechar o programa?

source: Yes, close it now!
pt: Sim, feche agora!

source: Oops! No!
pt: Oops! Não!

source: PLA plastic only!
pt: Apenas plástico PLA!

source: Make sure you're using PLA plastic before running this test. The machine won't work properly if you try to print this using any other kind of plastic.
pt: Certifique-se de estar usando filamento plástico de PLA antes de executar esse teste. A máquina não irá operar corretamente se você tentar imprimir este objeto de teste usando qualquer outro tipo de plástico.

source: Yes, I am using PLA filament.
pt: Sim, eu estou usando filamento de PLA.

source: 1mm Down
pt: Aproximar 1mm

source: 0.1mm Down
pt: Aproximar 0.1mm

source: 1mm Up
pt: Afastar 1mm

source: 0.1mm Up
pt: Afastar 0.1mm

source: move the extruder nozzle 1mm away from the build platform
pt: aumenta em 1mm a distância entre o bico extrusor e a plataforma de impressão

source: move the extruder nozzle 0.1mm away from the build platform
pt: aumenta em 0.1mm a distância entre o bico extrusor e a plataforma de impressão

source: move the extruder nozzle 1mm closer to the build platform
pt: diminui em 1mm a distância entre o bico extrusor e a plataforma de impressão

source: move the extruder nozzle 0.1mm closer to the build platform
pt: diminui em 0.1mm a distância entre o bico extrusor e a plataforma de impressão

source: Be sure to plug your 3d printer to the USB port before clicking 'install'.
pt: Certifique-se de conectar a impressora 3D a uma porta USB antes de clicar em 'instalar'.

source: Uploading firmware
pt: Instalando firmware

source: Please wait while the firmware is loaded. This may take a few minutes.
pt: Por favor aguarde enquanto o firmware é instalado. Esta operação pode levar alguns minutos.

source: downloading firmware image:
pt: fazendo download de firmware:

source: We're probably offline. We'll not look for updates this time. Please check your internet connection if you wish to receive software updates.
pt: Aparentemente estamos desconectados da rede, portanto não será feita busca por atualizações. Por favor, verifique sua conexão de internet se você pretende receber atualizações de software.

source: Source Code
pt: Código Fonte

source: Install
pt: Instalar

source: WX is not installed. This program requires WX to run.
pt: WX não está instalado. Este programa precisa do WX para funcionar.

source: Dimensions of Build Platform & optional offset of origin Examples: XXXxYYY XXX,YYY,ZZZ XXXxYYYxZZZ+OffX+OffY+OffZ
pt: Dimensões da plataforma & offset opcional da origem Exemplos: XXXxYYY XXX,YYY,ZZZ XXXxYYYxZZZ+OffX+OffY+OffZ

source: Last Set Temperature for the Heated Print Bed
pt: Última temperatura definida para a cama

source: Folder of last opened file
pt: Diretório do último arquivo aberto

source: Last Temperature of the Hot End
pt: Última temperatura do hotend

source: Width of Extrusion in Preview (default: 0.5)
pt: Largura da extrusão na prévia (padrão: 0.5)

source: Fine Grid Spacing (default: 10)
pt: Espaçamento da malha fina (padrão: 10)

source: Coarse Grid Spacing (default: 50)
pt: Espaçamento da malha grossa (padrão: 50)

source: Pronterface background color (default: #FFFFFF)
pt: Cor de fundo do Pronterface (padrão: #FFFFFF)

source: Printer Interface
pt: Interface da impressora

source: Metamaquina
pt: Metamáquina

source: version
pt: versão

source: Motors off
pt: Motores off

source: Switch all motors off
pt: Desligar todos os motores

source: Check temp
pt: Checar temp

source: Advance extruder by set length
pt: Avançar o extrusor esta medida

source: Extrude
pt: Extrusar

source: Reverse
pt: Reverter

source: Reverse extruder by set length
pt: Reverter extrusor esta medida

source: # I moved all your custom buttons into .pronsolerc. # Please don't add them here any more. # Backup of your old buttons is in custombtn.old
pt: # Eu movi todos os seus botões personalizados para .pronsolerc. # Por favor não adicione-os aqui novamente. # Um backup de todos os seus botões antigos está em custombtn.old

source: Note!!! You have specified custom buttons in both custombtn.txt and .pronsolerc
pt: Atenção! Você especificou botões personalizados em custombtn.txt e em .pronsolerc

source: Ignoring custombtn.txt. Remove all current buttons to revert to custombtn.txt
pt: Ignorando custombtn.txt. Remova todos botões atuais para reverter ao custombtn.txt

source: Failed to start web interface
pt: Falha ao iniciar interface web

source: CherryPy is not installed. Web Interface Disabled.
pt: CherryPy não está instalado. Interface web desabilitada.

source: Print
pt: Imprimir

source: Printer is now online.
pt: A impressora agora está online.

source: Disconnect
pt: Desconectar

source: Setting hotend temperature to %f degrees Celsius.
pt: Definindo temperatura do hotend para %f graus Celsius.

source: Printer is not online.
pt: A impressora não está online.

source: You cannot set negative temperatures. To turn the hotend off entirely, set its temperature to 0.
pt: Não é possível definir temperaturas negativas. Para desligar o hotend, defina a temperatura para 0.

source: You must enter a temperature. (%s)
pt: Você deve digitar uma temperatura. (%s)

source: Setting bed temperature to %f degrees Celsius.
pt: Definindo temperatura da cama para %f graus Celsius.

source: You cannot set negative temperatures. To turn the bed off entirely, set its temperature to 0.
pt: Não é possível definir temperaturas negativas. Para desligar a cama, defina a temperatura para 0.

source: Do you want to erase the macro?
pt: Você deseja apagar a macro?

source: Cancelled.
pt: Cancelado.

source: Opens file
pt: Abre arquivo

source: &Open...
pt: Abrir...

source: Edit open file
pt: Editar arquivo aberto

source: &Edit...
pt: &Editar...

source: Clear output console
pt: Apagar console de saída

source: Clear console
pt: Apagar console

source: Project slices
pt: Projetar fatias

source: Projector
pt: Projetor

source: Closes the Window
pt: Fecha a janela

source: E&xit
pt: &Sair

source: &File
pt: &Arquivo

source: <&New...>
pt: <&Nova...>

source: Options dialog
pt: Caixa de opções

source: &Options
pt: &Opções

source: Adjust slicing settings
pt: Ajustar configurações de fatiamento

source: Slicing Settings
pt: Configurações de fatiamento

source: &MM2 Documentation...
pt: &Documentação da Metamáquina 2...

source: Opens the Metamaquina 2 documentation in a web browser
pt: Abre a documentação da Metamáquina 2 em um navegador

source: &Help
pt: &Ajuda

source: &Settings
pt: &Configurações

source: &Z Calibration
pt: Calibração do eixo Z

source: Z Calibration wizard
pt: Rotina de calibração do eixo Z

source: &Firmware update
pt: Atualização de firmware

source: Firmware Update
pt: Atualização de firmware

source: Monitor mode
pt: Monitoramento de temperatura

source: Toggle monitor mode
pt: Liga/desliga o monitoramento de temperatura

source: Enter macro name
pt: Digite o nome da macro

source: Macro name:
pt: Nome da macro:

source: Name '%s' is being used by built-in command
pt: O nome '%s' é usado por um comando interno.

source: Port
pt: Porta

source: Connect
pt: Conectar

source: Reset
pt: Resetar

source: Load file
pt: Carregar arquivo

source: Pause
pt: Pausar

source: Print a test
pt: Teste de Impressão

source: Send
pt: Enviar

source: Watch
pt: Monitorar

source: Off
pt: Desligar

source: Bed:
pt: Cama:

source: Not connected to printer.
pt: Não conectado à impressora.

source: SD Upload
pt: Upload SD

source: SD Print
pt: Impressão SD

source: Mini mode
pt: Modo mini

source: Full mode
pt: Modo full

source: Execute command:
pt: Executar comando:

source: click to add new custom button
pt: Adicionar botão personalizado

source: Custom button number should be between 0 and 63
pt: Botão personalizado deve ter número entre 0 e 63

source: Edit custom button '%s'
pt: Editar botão personalizado '%s'

source: Move left <<
pt: Mover para esquerda <<

source: Move right >>
pt: Mover para direita >>

source: Remove custom button '%s'
pt: Remover botão personalizado '%s'

source: Add custom button
pt: Adicionar botão personalizado

source: event object missing
pt: falta objeto do evento

source: Invalid period given.
pt: Período inválido.

source: Monitoring printer.
pt: Monitorando impressora.

source: Done monitoring.
pt: Fim do monitoramento.

source: SD printing:%04.2f %%
pt: Imprimindo do SD:%04.2f %%

source: Printing: %04.2f%% |
pt: Imprimindo: %04.2f%% |

source: Line# %d of %d lines |
pt: Linha# %d de %d linhas |

source: Est: %s of %s remaining |
pt: Est: %s de %s restantes |

source: Opening file failed.
pt: Falha ao abrir arquivo.

source: Starting print
pt: Iniciando impressão

source: Pick SD file
pt: Escolha arquivo do SD

source: Select the file to print
pt: Selecione o aquivo para impressão

source: Failed to execute slicing software:
pt: Falha ao executar software fatiador:

source: Slicing...
pt: Fatiando...

source: , %d lines
pt: , %d linhas

source: Loaded
pt: Carregado

source: Load File
pt: Carregar arquivo

source: Slicing
pt: Fatiando

source: Open file to print
pt: Abrir arquivo para impressão

source: OBJ, STL, and GCODE files (*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ)|*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ|All Files (*.*)|*.*
pt: Arquivos OBJ, STL, e GCODE (*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ)|*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ|Todos os arquivos (*.*)|*.*

source: File not found!
pt: Arquivo não encontrado!

source: Loaded %s, %d lines
pt: Carregados %s, %d linhas

source: mm of filament used in this print
pt: mm de filamento usados nesta impressão

source: the print goes from %f mm to %f mm in X and is %f mm wide
pt: a impressão vai de %f mm a %f mm em X e tem %f mm de extensão

source: the print goes from %f mm to %f mm in Y and is %f mm wide
pt: a impressão vai de %f mm a %f mm em Y e tem %f mm de extensão

source: the print goes from %f mm to %f mm in Z and is %f mm high
pt: a impressão vai de %f mm a %f mm em Z e tem %f mm de altura

source: Estimated duration (pessimistic):
pt: Duração estimada (pessimista):

source: No file loaded. Please use load first.
pt: Nenhum arquivo carregado. Carregue um arquivo antes.

source: Restart
pt: Reiniciar

source: File upload complete
pt: Finalizado o envio de arquivo.

source: Pick SD filename
pt: Escolha um nome de arquivo SD

source: Paused.
pt: Pausado.

source: Resume
pt: Retomar

source: Connecting...
pt: Conectando...

source: Disconnected.
pt: Desconectado.

source: Reset.
pt: Resetada.

source: Are you sure you want to reset the printer?
pt: Tem certeza que deseja resetar a impressora?

source: Reset?
pt: Resetar?
